In [20]:
import pandas as pd
import numpy as np

In [21]:
dataset=pd.read_csv("Salary_Data_Based_country_and_race.csv")

In [22]:
dataset

,Si.NO,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country
0,0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0,UK
1,1,28.0,Female,Master's,Data Analyst,3.0,65000.0,USA
2,2,45.0,Male,PhD,Senior Manager,15.0,150000.0,Canada
3,3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0,USA
4,4,52.0,Male,Master's,Director,20.0,200000.0,USA
...,...,...,...,...,...,...,...,...
6699,6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0,UK
6700,6700,32.0,Male,High School,Sales Associate,3.0,50000.0,Australia
6701,6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0,China
6702,6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0,China
6703,6703,26.0,Female,High School,Sales Executive,1.0,35000.0,Canada

In [23]:
dataset.isna().sum()

Si.NO                    0
Age                      2
Gender                   2
Education Level          3
Job Title                2
Years of Experience    123
Salary                   5
Country                  0
dtype: int64

In [24]:
#sepreated the QuanQual dataset
quan=[]
qual=[]
for columnsName in dataset.columns:
    if(dataset[columnsName].dtype=='O'):
        #print("qual")
        qual.append(columnsName)
    else:
        #print("quan")
        quan.append(columnsName)

In [25]:
dataset[quan].isna().sum()

Si.NO                    0
Age                      2
Years of Experience    123
Salary                   5
dtype: int64

In [26]:
qual

['Gender', 'Education Level', 'Job Title', 'Country']

In [27]:
dataset[qual].isna().sum()

Gender             2
Education Level    3
Job Title          2
Country            0
dtype: int64

In [30]:


# Assuming 'dataset' is your DataFrame and 'qual' is the column name
# Replace 'qual' with the actual column name you want to impute
dataset[qual].fillna(dataset[qual].mode().iloc[0], inplace=True)

In [31]:
dataset[qual].isna().sum()

Gender             2
Education Level    3
Job Title          2
Country            0
dtype: int64

In [32]:
quan

['Si.NO', 'Age', 'Years of Experience', 'Salary']

In [33]:
dataset[quan].isna().sum()

Si.NO                    0
Age                      2
Years of Experience    123
Salary                   5
dtype: int64

In [34]:
dataset.fillna(dataset["Age"].mean(),inplace=True)

In [35]:
dataset.fillna(0, inplace=True)

In [36]:
dataset[quan].isna().sum()

Si.NO                  0
Age                    0
Years of Experience    0
Salary                 0
dtype: int64

In [37]:
preprocess=dataset

In [38]:
preprocess.to_csv("preprocessed",index=False)

In [39]:
preprocess.isna().sum()

Si.NO                  0
Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
Country                0
dtype: int64